# 컴퓨터 시스템

## 하드웨어
컴퓨터를 구성하는 기계적 장치로 다음과 같은 구성요소를 포함합니다:
- **중앙처리장치(CPU)**
- **기억장치**:
  - RAM
  - HDD
- **입출력 장치**:
  - 마우스
  - 키보드
  - 프린터

## 소프트웨어
하드웨어의 동작을 지시하고 제어하는 명령어 집합으로 다음과 같은 소프트웨어 유형이 있습니다:
- **시스템 소프트웨어**:
  - 운영체제
  - 컴파일러
- **응용 소프트웨어**:
  - 워드 프로세서
  - 스프레드시트

## 하드웨어
하드웨어는 중앙처리장치(CPU), 기억장치, 입출력장치로 구성되어 있습니다. 이들은 시스템 버스로 연결되어 있으며, 시스템 버스는 데이터와 명령 제어 신호를 각 장치로 실어나르는 역할을 합니다.

### 중앙처리장치(CPU)
- 인간으로 따지면 두뇌에 해당하는 부분
- ALU(산술 논리 연산장치)와 제어장치로 구성
- 개인용 컴퓨터에서는 CPU를 마이크로프로세서라고도 부름

### 기억장치
- 프로그램, 데이터, 연산 중간 결과를 저장하는 장치
- 주기억장치와 보조기억장치로 나누어짐
- 주기억장치: RAM, ROM
- 보조기억장치: HDD, SSD

### 입출력장치
- 입력과 출력 장치로 나누어짐
- 입력 장치: 키보드, 마우스
- 출력 장치: 프린터, 모니터, 스피커

## 시스템버스
하드웨어 구성 요소를 물리적으로 연결하는 선을 뜻합니다. 각 구성요소가 다른 구성요소로 데이터를 보낼 수 있도록 통로가 되어줍니다. 용도에 따라 데이터 버스, 주소 버스, 제어 버스로 나누어집니다.

### 데이터 버스
- 중앙처리장치와 기타 장치 사이에서 데이터를 전달하는 통로
- 양방향 버스
- 주소 버스와 데이터 버스 사이의 데이터 전송 담당

### 주소 버스
- 기억장치의 주소를 전달하는 통로
- 단방향 버스

### 제어 버스
- 중앙처리장치가 기억장치나 입출력장치에 제어 신호를 전달하는 통로
- 양방향 버스
- 기억장치 읽기/쓰기, 버스 요청/승인, 인터럽트 요청/승인, 클락, 리셋 등 제어 신호 전달
